In [64]:
import pandas as pd

df = pd.read_csv("train.csv")  # Titanic training dataset

df = df.dropna(subset=["Age"])
display(df.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
melted = summary.melt(
    id_vars=['Pclass', 'Sex'],
    value_vars=[0, 1],
    var_name='Survival_Status',
    value_name='Count'
)

display(melted)

    Pclass     Sex Survival_Status  Count
0        1  female               0      3
1        1    male               0     77
2        2  female               0      6
3        2    male               0     91
4        3  female               0     72
5        3    male               0    300
6        1  female               1     91
7        1    male               1     45
8        2  female               1     70
9        2    male               1     17
10       3  female               1     72
11       3    male               1     47

In [68]:
df.select_dtypes(include='number').aggregate(['sum', 'min'])

     PassengerId  Survived  Pclass       Age  SibSp  Parch       Fare
sum       320288       290    1597  21205.17    366    308  24771.883
min            1         0       1      0.42      0      0      0.000

In [70]:
df.aggregate(
    {
        "Survived": ["mean"],
        "Age": ["min", "max", "mean"]
    }
)

      Survived        Age
mean  0.406162  29.699118
min        NaN   0.420000
max        NaN  80.000000

In [72]:
bins = [0, 12, 18, 39, 59, 80]
# [0-12, 13-18, 19-39, 40-59, 60-80] 
labels = ["Child", "Teen", "Adult","Middle-Aged", "Senior Citizen"]

df["Age_Group"] = pd.cut(df["Age"], bins=bins, labels=labels)
display(df.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult

In [74]:
survival_by_age = df.groupby("Age_Group").aggregate({"Survived": ["mean"]})
display(survival_by_age)

/tmp/ipykernel_2826/4035302279.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival_by_age = df.groupby("Age_Group").aggregate({"Survived": ["mean"]})

                Survived
                    mean
Age_Group
Child           0.579710
Teen            0.428571
Adult           0.385922
Middle-Aged     0.394161
Senior Citizen  0.269231